[{"userId":"822096220","name":"Ibrahim","email":"Ibrahim@gmail.com","phone":"01145452440","message":"ay7aga\r\n"},{"userId":"822096220","name":"Ibrahim","email":"Ibrahim@gmail.com","phone":"01145452440","message":"ay7aga\r\n"},{"userId":"822096220","name":"Ibrahim","email":"Ibrahim@gmail.com","phone":"01145452440","message":"ay7aga\r\n"},{"userId":"822096220","name":"Ahmed","email":"ebrahimelazazy1@yahoo.com","phone":"01094989981","message":"sld;mas;lfmledfsdfSDF\r\nsdf\r\nsdfsdfsdlfomsdfmplksdgv\r\nsdfsdl,f;lsd,f;ldsfasfsdfsdfd"},{"userId":"822096220","name":"ay7aga","email":"ay7aga@ay7aga.ay7aga","phone":"01145452440","message":"In the Web interface, unsupported HTML elements and attributes in the rich content are silently discarded after you save the item.\r\n• You can paste text using CTRL+V where the  icon behaves as a toggle to paste copied text as plain text.\r\n• You cannot copy and paste HTML source that exceeds the maximum allowed characters for the rich content field. If you exceed the amount, Windchill RV&S allows you to attempt the operation again until you copy and paste an acceptable number of characters.\r\n• To use rich content from sources other than Microsoft Word, paste such content in Microsoft Word. Copy this source content from Microsoft Word and paste it in the rich content field. This ensures that the formatted text and images are preserved in the rich content fields when using the Windchill RV&S client GUI.\r\n• The cut and copy commands are available only in the GUI. In the Web interface, use shortcut keys or the browser’s cut, copy, and paste toolbar buttons.\r\n• When copying and pasting table cells, you can select the table row or a single cell.\r\n• When copying and pasting a table row, the pasted row is inserted as a new row above the currently selected row.\r\n• Pasted images from HTML source that is not an external Web site are assigned the following naming convention: PTC<#>.png.\r\n• In the Web interface, you can copy and paste an image containing a local file URL (file:\/\/). However, Windchill RV&S warns you that the image is not visible to other users because local file URLs to images cannot be saved as attachments.\r\n• After pasting an image in the Windchill RV&S client GUI, the operation for rendering the pasted image takes some time.\r\n• Copying and pasting inline image attachments:\r\n◦ Copying from one item and pasting to another results in a new attachment associated with the destination item.\r\n◦ Copying and pasting within the same item reuses the attachment in each location.\r\n• In the Web interface, you can copy and paste special characters. However, Windchill RV&S does not support the insertion of special characters in the Web interface.\r\n• You can copy and paste text containing different fonts and font sizes in the rich content field of the Web interface and the GUI. For more information on working with fonts in rich text fields, see Formatting and Editing Text.\r\n• When copying or pasting rich text content from an external source, the Windchill RV&S rich text fields support the following units during conversion for font size:\r\n◦ %\r\n◦ pt\r\n◦ px\r\n◦ pc\r\n◦ em\r\n◦ ex\r\n◦ inch\r\n◦ cm\r\n◦ mm\r\nWindchill RV&S converts the unsupported font size units to the default values in the rich text fields while pasting external rich text content."}]